Documents/ЗаявкаНаИзготовлениеОбразца.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявкаНаИзготовлениеОбразца</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаВыполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзделиеЗаказчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияЗаказчика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Образцы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Образец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Образец</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Комментарии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКомментария</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КартинкиОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КартинкиОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектТЗ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектыДляКартинок</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЗаявкаНаИзготовлениеОбразца/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
&НаКлиенте
Перем МассивАдресовКартинок, ВсегоКартинокОбразца, НомерКартинкиОбразца;
#Область Картинки
&НаКлиенте
Перем МассивИменВременныхФайлов;
&НаКлиенте
Перем  ВсегоКартинок Экспорт;
&НаКлиенте
Перем НомерКартинки Экспорт;

&НаКлиенте
Процедура ОбщаяКомандаКартинка(Команда)
	омКартинкиНаКлиенте.ОбщееДействие(ЭтаФорма, ТекущийЭлемент, ОписаниеНомерКартинки, Истина, МассивИменВременныхФайлов);
КонецПроцедуры 

&НаКлиенте
Процедура ИнформацияОКартинках(ТекущийНомерКартинки = 0)

	ВсегоКартинок = омКартинкиНаСервере.ПолучитьИнформациюОКартинках(Объект.Ссылка, Истина);
	ОписаниеНомерКартинки = ТекущийНомерКартинки;

КонецПроцедуры // ИнформацияОКартинках()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);

	Если Параметры.Ключ.Пустая() Тогда
		Элементы.ГруппаКартинки.Видимость 				= Ложь;
		Элементы.ДекорацияНеобходимоЗаписать.Видимость 	= Истина;
	Иначе
		Элементы.ДекорацияНеобходимоЗаписать.Видимость 	= Ложь;
	КонецЕсли;
	
	омКартинкиНаСервере.СоздатьЭлементыИРеквизитыНаФорме(ЭтаФорма, Элементы.ГруппаКартинки, Истина);
	
	Элементы.ЗаявкаВыполнена.Доступность 	= РольДоступна("ПолныеПрава") ИЛИ РольДоступна("НачальникПроизводства");
	Элементы.Группа4.ТолькоПросмотр			= Объект.ЗаявкаВыполнена;
	
	омКомментарииНаСервере.СоздатьЭлементыИРеквизитыНаФорме(ЭтаФорма, Элементы.ГруппаКомментарий, Ложь); 
	ДополнительныеПараметры = Неопределено;
	Этаформа.Комментарий_авто = омКомментарииНаСервере.Получить_HTML_комментарий(Объект.Комментарии, , , ДополнительныеПараметры);
	Элементы.ГруппаКомментарий.Заголовок = омКомментарийКлиентСервер.ПолучитьЗаголовокСтраницы(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиКартинку()

	ИнформацияОКартинках();
	омКартинкиНаКлиенте.ВывестиКартинку(Объект.Ссылка, НомерКартинки, ЭтаФорма, ВсегоКартинок);
	
КонецПроцедуры // ВывестиКартинку()

#КонецОбласти 

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИзменилииКартинкиОбъектТЗ" И Параметр.ОбъектТЗ = Объект.Ссылка Тогда
		#Область Картинки
		ВывестиКартинку();
		#КонецОбласти
	Иначе
	
		
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Элементы.ГруппаКартинки.Видимость 				= Истина;
	Элементы.ДекорацияНеобходимоЗаписать.Видимость 	= Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МассивАдресовКартинок = Новый Массив;
	
	ВсегоКартинокОбразца = 0;
	НомерКартинкиОбразца = 0;
	
#Область Картинки
 	МассивИменВременныхФайлов = Новый Массив;
	НомерКартинки = 0;;
	ВывестиКартинку();
#КонецОбласти

КонецПроцедуры 

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	#Область Картинки
	омКартинкиНаКлиенте.УдалитьВременныеФайлы(МассивИменВременныхФайлов);
	#КонецОбласти
	
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяКомандаКомментарий(Команда)
	омКомментарииНаКлиенте.ОбщееДействие(ЭтаФорма, ТекущийЭлемент);
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяКомандаВсеКомментарии(Команда)
	омКомментарииНаКлиенте.ВсеКомментарий(ЭтаФорма, ТекущийЭлемент);
КонецПроцедуры

&НаКлиенте
Процедура ИзделиеЗаказчикаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Проект) Тогда
		
		ДополнительныеПараметры = Новый Структура("Отказ, ТолькоНеИспользованые, НомерПоПорядку" ,Ложь ,Ложь ,0);
		омИзделиеЗаказчикаКлиент.ОткрытьПодборИзделияЗаказчика(Объект, ЭтаФорма, Неопределено, СтандартнаяОбработка, ДополнительныеПараметры);
		
	Иначе
		СтандартнаяОбработка = Ложь;
		ПоказатьПредупреждение(, "Не заполнен проект");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораИзделияЗаказчика(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;                         
	
	Объект.ИзделиеЗаказчика = Результат;	
	
КонецПроцедуры // ПослеВыбораИзделияЗаказчика()

&НаКлиенте
Процедура КартинкаВЛево(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КартинкаВПраво(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОбразцыПриАктивизацииСтроки(Элемент)
	ТД = Элементы.Образцы.ТекущиеДанные;
	
	КартинкаОбразца = Неопределено;
	ВсегоКартинокОбразца = 0;
	НомерКартинкиОбразца = 0;
	
	Если ТД = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ВывестиКартинкиОбразца(ТД.Образец);
	
	
КонецПроцедуры 

&НаКлиенте
Процедура ВывестиКартинкиОбразца(Образец, НомерКартинкиОбразца = 0)

	ОбразецНайден = Ложь;
	
	Для каждого КартинкиОбразца Из МассивАдресовКартинок Цикл
	
		Если КартинкиОбразца.Образец = Образец Тогда
			ВывестиКартинкуОбразца(КартинкиОбразца, НомерКартинкиОбразца);
		    ОбразецНайден = Истина;
		КонецЕсли;	
	
	КонецЦикла;
	
	Если НЕ ОбразецНайден Тогда
	
		МассивАдресовКартинок.Добавить(ПолучитьДанныеКартинки(Образец, ЭтаФорма.УникальныйИдентификатор));
		
	КонецЕсли;

	ВывестиКартинкуОбразца(КартинкиОбразца, НомерКартинкиОбразца);

КонецПроцедуры 

&НаКлиенте
Процедура ВывестиКартинкуОбразца(КартинкиОбразца, НомерКартинкиОбразца)
	
	Если КартинкиОбразца = Неопределено Тогда
		
		КартинкаОбразца = Неопределено;
		ВсегоКартинокОбразца = 0;
		НомерКартинкиОбразца = 0;
		
	Иначе
		
		ВсегоКартинокОбразца = КартинкиОбразца.МассивАдресов.Количество();
		
		Если ВсегоКартинокОбразца = 0 Тогда
			Элементы.КартинкаВлево.Доступность 	= Ложь;
			Элементы.КартинкаВправо.Доступность = Ложь;
		Иначе	
			Элементы.КартинкаВлево.Доступность 	= НомерКартинкиОбразца > 0;
			Элементы.КартинкаВправо.Доступность = НомерКартинкиОбразца < ВсегоКартинокОбразца - 1;
			
			КартинкаОбразца = ПолучитьИзВременногоХранилища(КартинкиОбразца.МассивАдресов[НомерКартинкиОбразца]); 
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры  


&НаСервереБезКонтекста
Функция ПолучитьДанныеКартинки(Образец, УникальныйИдентификатор)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КартинкиОбъектов.Картинка КАК Картинка
		|ИЗ
		|	РегистрСведений.КартинкиОбъектов КАК КартинкиОбъектов
		|ГДЕ
		|	КартинкиОбъектов.ОбъектТЗ = &ОбъектТЗ
		|
		|УПОРЯДОЧИТЬ ПО
		|	КартинкиОбъектов.НомерПоПорядку";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", Образец);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	КартинкиОбразца = Новый Структура("Образец, МассивАдресов", Образец, Новый Массив);
	
	Пока Выборка.Следующий() Цикл
		КартинкиОбразца.МассивАдресов.Добавить(ПоместитьВоВременноеХранилище(Выборка.Картинка.Получить()));
	КонецЦикла;
	
	Возврат КартинкиОбразца;
	
КонецФункции // ПолучитьДанныеКартинки()
